Repository: hucste/Hashable
Catalog: locale/*/LC_MESSAGES/Hashable.po
Languages: fr

source: Calculate
fr: Calculer

source: Calculate a folder
fr: Calculer un répertoire

source: Control
fr: Contrôler

source: Control by file
fr: Contrôle par fichier

source: Current folder
fr: Répertoire courant

source: Home directory
fr: Répertoire personnel

source: Choose one or more files:
fr: Choisissez un ou plusieurs fichiers :

source: Choose one folder:
fr: Choisissez un répertoire :

source: Choose a file to act:
fr: Choisissez un fichier :

source: Choose your checksum file:
fr: Choisissez votre fichier de somme de contrôle :

source: Text
fr: Texte

source: Software to calcul or control checksum file...
fr: Logiciel pour calculer ou contrôle la somme de contrôle d'un fichier ...

source: Apply
fr: Appliquer

source: Cancel
fr: Annuler

source: No
fr: Non

source: Quit
fr: Quitter

source: Yes
fr: Oui

source: Error: Your checksum is bad! Your archive seems corrupt. :(
fr: Erreur: Votre somme de contrôle est mauvaise ! Votre archive semble corrompue. :(

source: Yeahhh: Good checksum egual good archive! :D
fr: Youpi: Votre archive est bonne ! :D

source: For the file %(file)s, your checksum is %(checksum)s
fr: Pour le fichier %(file)s, votre somme de contrôle est %(checksum)s

source: Do you want to save checksums in file?
fr: Désirez-vous sauvegarder votre somme de contrôle dans un fichier ?

source: Your checksum is empty, please fill-it!
fr: Votre somme de contrôle est vide, veuillez remplir le champ correspondant !

source: The algorithm choosed (%(algo)s) and algorithm in checksum file
fr: L'algorithme choisi (%(algo)s) et l'algorithme dans le fichier de somme de contrôle

source: (%(algorithm)s) are different! Are you sure of your choise?
fr: (%(algorithm)s) sont différents ! Êtes-vous sûr de votre choix ?

source: The file choosed (%(fileName)s) and file in checksum file
fr: Le fichier choisi (%(fileName)s) et le fichier dans le fichier de somme de contrôle

source: (%(checksumFile)s) are different! Are you sure?
fr: (%(checksumFile)s) sont différents ! Êtes-vous sûr ?

source: The value generator, in xml file, seems different: %s
fr: La valeur 'generator', dans le fichier xml, semble être différent : %s

source: Error: The algorithm specified %(algorithm)s in checksum file
fr: Erreur : L'algorithme spécifié %(algorithm)s dans le fichier de somme de contrôle

source: is not supported!
fr: n'est pas supporté !

source: Error: It seems to be an error during creation of the hash!
fr: Erreur : Il semble y avoir une erreur durant la création du hash !

source: Error: The key %s in dict hashlib not exists... Booo!
fr: Erreur : La clé %s dans le dictionnaire hashlib n'existe pas ... Bouh !

source: Your python's version is too oldier. (version: %s)
fr: Votre version de Python est trop vieille. (version: %s)

source: Please upgrade, at minimum, to 2.5!
fr: Veuillez mettre-à-jour, au moins, vers la 2.5 !

source: All Files
fr: Tous fichiers

source: About
fr: À-propos

source: Edit
fr: Éditer

source: _Files
fr: _Fichiers

source: H_elp
fr: Aid_e

source: _New
fr: _Nouveau

source: Preferences
fr: Préférences

source: Choose an action:
fr: Choisissez une action :

source: Choose an algorithm:
fr: Choisissez un algorithme :

source: Choose your file out:
fr: Choisissez votre format de fichier de sauvegarde :

source: Copy your checksum, here:
fr: Copiez votre somme de contrôle, ici :

source: recursive:
fr: récursif :

source: Folder preferred for File Chooser:
fr: Répertoire préféré pour le Gestionnaire de fichiers :

source: GUI Project:
fr: Projet d'Interface Graphique :

source: Need to restart the program to apply the new preferences!
fr: Besoin de redémarrer le programme pour appliquer les nouvelles préférences !

source: The preferences are saved. Close this window and restart the program!
fr: Les préférences sont sauvées. Fermez cette fenêtre et redémarrer le programme !

source: Process ending!
fr: Processus terminé !

source: Initialize...
fr: Initialisation ...

source: Processing...
fr: Processus en cours ...

source: Wait...
fr: Veuillez patienter ...

source: Checksum
fr: Somme de Contrôle

source: File
fr: Fichier

source: Size
fr: Taille

source: Python Error Version
fr: Python Erreur Version

source: Files and Checksums results!
fr: Résultat des Fichiers et Sommes de Contrôle !

source: Saving yours checksums!
fr: Sauvegarder vos somme de contrôle !
